run/TPerturbInVerticalFlow/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

vel    1;

internalField   uniform (0 $vel 0);

boundaryField
{
    floor
    {
//        type            slip;
        type            fixedValue;
        value           uniform (0 $vel 0);
    }

    ceiling
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 $vel 0);
//        type            slip;
//        type            fixedValue;
//        value           uniform (0 $vel 0);
    }

    fixedWalls
    {
        type            slip;
    }
}


// ************************************************************************* //
